{"/docs/core-concepts/":{"data":{"":"The Asset–Task Flow (ATF) Methodology is a lightweight framework that operationalizes the principle that all data assets are not equal. It addresses the twin challenges of documentation cost and value measurement by adopting an Asset-First perspective.\nThe Two Pillars of Governance:\nShift Left Governance (Asset Perspective): From the Asset perspective, ATF recognizes that governance debt accumulates rapidly when documentation is done later. We flip this by making the Asset the central hub of all information. Every task, every mutation, every context point is logged directly against the Asset from the start, ensuring seamless, lesser-friction documentation that eliminates the need for expensive, reactive governance tools down the line.\nValue-Driven Governance (Flow Perspective): The governance visibility gained from the Asset perspective is then directly leveraged by the Flow perspective. This provides a new form of governance where assets are governed based on their measurable contribution and operational cost.\nThis relationship provides the necessary context: The Flow informs the required Value of the Asset, and the associated Tasks quantify the Operational Cost incurred to deliver that value.\nTo understand your true cost of ownership and measure value through this methodology, you must map the three entities that exist in your daily reality:\nFlows (The Outcome): The measurable business objective (e.g., “Quarterly Financial Reporting,” “Real-time Fraud Detection”).\nTasks (The Work): The actual engineering effort (tickets) expended.\nAssets (The Inventory): The data objects (tables, models, APIs) being built or maintained.\nBy linking these three entities, we stop managing generic “tickets” and start managing Impact."},"title":"Core Concepts"},"/docs/implementation/":{"data":{"":"You don’t need expensive new software to implement ATF. You can start today with the tools you already use, like Jira, Linear, or GitHub Issues.","1-define-your-assets#1. Define Your Assets":"Create a list of your key data assets. This could be a simple spreadsheet or a dedicated “Assets” project in your issue tracker.","2-configure-your-issue-tracker#2. Configure Your Issue Tracker":"Add two custom fields to your issue tracker:\nLinked Asset ID: A reference to the asset being modified. Task Type: A dropdown with values: Flow, Flowless, Ad Hoc.","3-link-tasks-to-assets#3. Link Tasks to Assets":"Every time you create a ticket, ensure it is linked to an Asset and has a Task Type assigned.","implementation-steps#Implementation Steps":"","quick-start-script#Quick Start Script":"Here is a Python script to help you analyze your tasks if you export them to CSV:\nimport pandas as pd def analyze_tasks(csv_file): df = pd.read_csv(csv_file) # Group by Task Type type_counts = df['Task Type'].value_counts() print(\"Task Distribution:\") print(type_counts) # Calculate \"Rent\" (Flowless tasks per Asset) rent = df[df['Task Type'] == 'Flowless'].groupby('Linked Asset ID').size() print(\"\\nAsset Rent (Top 5):\") print(rent.sort_values(ascending=False).head()) if __name__ == \"__main__\": analyze_tasks('tasks.csv')"},"title":"Implementation"},"/docs/introduction/":{"data":{"":"Most data teams function like a service bureau: a ticket comes in, we assign a resource, we ship the asset (a table, a dashboard, a pipeline), and we move on. Over time, we accumulate a massive portfolio of data assets. Some drive millions in revenue; others are zombie tables used by no one. But all of them require maintenance.\nOften times, we ask the fundamental operational question: What is the “rent” we pay in engineering hours to keep a specific asset alive, and does the business value justify that cost?\nWithout this visibility, teams drown in unprioritized maintenance, and leadership struggles to understand why the headcount budget isn’t translating to faster feature delivery.\nWe don’t need more heavy governance tools for this. We need Operational Intelligence.\nThis is the premise of the Asset–Task Flow (ATF) Methodology.","the-root-cause-the-governance-debt-trap#The Root Cause: The Governance Debt Trap":"Why does this blind spot exist? It exists because we are using tools built for software tasks to manage data realities.\nIn software engineering, a ticket often represents a transient change: write the code, ship the feature, close the ticket. The code merges into the repository, and the task is done.\nBut data is different. Data is persistent.\nWhen we ship a pipeline or a table, we create a permanent Asset that requires feeding, cleaning, and protecting. Standard project management tools (Jira, Linear, Asana) are excellent at tracking tasks, but they are terrible at tracking the state of the things we build.\nOver time, as we complete thousands of tasks, we mutate the state of these assets. Because our tools don’t track this link, we create a drift between reality and documentation. This creates confusion, rework, and a silent accumulation of Governance Debt.\nWe treat governance as an afterthought or a tax we pay once a quarter. This is reactive, expensive, and rarely accurate. By the time you realize you don’t know why core_revenue breaks every Tuesday, you are already deep in debt.\nTo fix this, we must Shift Left.\nWe must abandon the practice of managing generic tickets only to govern assets (e.g. table, metrics, data pipelines, etc) later with separate tools, which forces governance into an expensive, reactive afterthought. The solution is to manage the Assets from the start. Governance is not a side project; it must be the natural, automatic byproduct of the work itself."},"title":"Introducing the Asset Task Flow"},"/docs/specification/":{"data":{"":"In the ATF framework, not all work is created equal. Every hour an engineer spends falls into one of three distinct categories. Understanding the balance between these categories is the key to strategic resource allocation.\nFlow Tasks (Value Generation): These are tasks explicitly linked to a Business Flow. Example: “Ingest new demographic signals for the Churn Prediction Model.”\nThe Reality: This is the work that shows up on the roadmap. It is the work stakeholders think we are doing 100% of the time.\nAd Hoc Tasks (Demand Signals): Stakeholders often bypass roadmaps for quick answers. The traditional engineering instinct is to block these requests. ATF takes a different approach: Ad Hoc is data. The Strategy: Instead of building process walls, we track “Ad Hoc” tasks against the specific Asset they touch.\nThe Insight: If you see 20 ad hoc requests hitting the booking_logs table in a month, you haven’t found a nuisance; you have found a Shadow Flow. This is empirical evidence of business demand that justifies building a self-service tool or automating a formal Flow.\nFlowless Tasks (The Operational Reality): This is the most critical category for measuring Cost of Ownership. A Flowless Task is any work required to keep an Asset operational that does not add new features. Crucially, this is not a penalty.\nIn many organizations, maintenance is viewed as “fixing bugs” or “cleaning up bad code.” This is a reductive view. Flowless tasks represent the operational reality of a living system. When an asset generates a high volume of operational work, it triggers a specific diagnostic question: Is this Rot, or is this Growth?\nScenario A (Rot): A pipeline breaks weekly because the code is brittle or dependencies are circular.\nDiagnosis: Technical Debt.\nAction: Refactor or Deprecate.\nScenario B (Growth): A core transaction table is experiencing exponential data growth. The team is spending hours optimizing queries, partitioning storage, and scaling compute to keep up with ingestion volume.\nDiagnosis: Scale.\nAction: This is a signal for Infrastructure Investment.\nBy categorizing Flowless Tasks, we move the conversation from “why is the team so slow?” to “Asset X is growing exponentially and requires architectural investment to sustain.”"},"title":"Asset–Task Flow Specification"}}